#Использовать autumn
#Использовать ".."
#Использовать asserts

Перем Сервер;

Процедура ПередЗапускомТеста() Экспорт	
	ВключитьСервер();
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура ВключитьСервер() 
	
	Если Сервер = Неопределено Тогда
		Сервер = Новый Поделка();
		ФоновыеЗадания.Выполнить(Сервер, "ЗапуститьПриложение");
	КонецЕсли;

КонецПроцедуры

Функция ГетЗапрос(АдресТеста)
	Соединение = Новый HTTPСоединение("http://localhost",3333,,,,5);
	Запрос = Новый HTTPЗапрос(СтрШаблон("/tests/%1", АдресТеста));
	Ответ = Соединение.Получить(Запрос);
	Возврат Ответ;
КонецФункции

Функция ПостЗапросТелоИзСтроки(АдресТеста, ТелоЗапроса)
	Соединение = Новый HTTPСоединение("http://localhost",3333,,,,5);
	Запрос = Новый HTTPЗапрос(СтрШаблон("/tests/%1", АдресТеста));
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Возврат Ответ;
КонецФункции

&Тест
Процедура Должен_ПроверитьЗапускСервере() Экспорт

	// Дано
	АдресТеста = "checkup";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьОбработкуГетПараметров() Экспорт

	// Дано
	АдресТеста = "getparams?animal1=Кошка&animal2=Собака";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("Кошка И Собака");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьОбработкуУпорядоченныхГетПараметров() Экспорт

	// Дано
	АдресТеста = "getorderedparams/Кошка/Собака";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("Кошка И Собака");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьОбработкуПостЗапроса() Экспорт

	// Дано
	АдресТеста = "postparams";
	ТелоЗапроса = "animal1=Кошка&animal2=Собака";

	// Когда
	Ответ = ПостЗапросТелоИзСтроки(АдресТеста, ТелоЗапроса);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("Кошка И Собака");

КонецПроцедуры
