#Использовать autumn
#Использовать ".."
#Использовать asserts

Процедура ПередЗапускомТеста() Экспорт	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	УстановитьТекущийКаталог(ТекущийСценарий().Каталог);
КонецПроцедуры

Функция ВключитьСервер() 

	Поделка = Новый Поделка();
	ФоновыеЗадания.Выполнить(Поделка, "ЗапуститьПриложение");

	Возврат Поделка;
	
КонецФункции

Процедура ВыключитьСервер(Сервер)
	ЖелудьВыключатор = Сервер.НайтиЖелудь("СлушательПорта");
	ЖелудьВыключатор.Остановить();
КонецПроцедуры

Функция ГетЗапрос(АдресТеста)
	Соединение = Новый HTTPСоединение("http://localhost",3333,,,,5);
	Запрос = Новый HTTPЗапрос(СтрШаблон("/tests/%1", АдресТеста));
	Ответ = Соединение.Получить(Запрос);
	Возврат Ответ;
КонецФункции


&Тест
Процедура Должен_ПроверитьЗапускСервере() Экспорт
	// Дано
	Сервер = ВключитьСервер();

	// Когда
	Ответ = ГетЗапрос("checkup");
	ВыключитьСервер(Сервер);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);


КонецПроцедуры
