#Использовать autumn
#Использовать ".."
#Использовать asserts

Перем Сервер;

Процедура ПередЗапускомТеста() Экспорт	
	ВключитьСервер();
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура ВключитьСервер() 
	
	Если Сервер = Неопределено Тогда
		Сервер = Новый Поделка();
		ФоновыеЗадания.Выполнить(Сервер, "ЗапуститьПриложение");
		// Подождем что бы сервер успел запустится и проинициализироваться.
		Приостановить(1000);
	КонецЕсли;

КонецПроцедуры

Функция ГетЗапрос(АдресТеста, Заголовки = Неопределено)
	Соединение = Новый HTTPСоединение("http://localhost",3333,,,,5);
	Запрос = Новый HTTPЗапрос(СтрШаблон("/tests/%1", АдресТеста));
	Если Не Заголовки = Неопределено Тогда
		Запрос.Заголовки = Заголовки;
	КонецЕсли;
	Ответ = Соединение.Получить(Запрос);
	Возврат Ответ;
КонецФункции

Функция ПостЗапросТелоИзСтроки(АдресТеста, ТелоЗапроса, Заголовки = Неопределено)
	Соединение = Новый HTTPСоединение("http://localhost",3333,,,,5);
	Запрос = Новый HTTPЗапрос(СтрШаблон("/tests/%1", АдресТеста));
	Если Не Заголовки = Неопределено Тогда
		Запрос.Заголовки = Заголовки;
	КонецЕсли;
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Возврат Ответ;
КонецФункции

&Тест
Процедура Должен_ПроверитьЗапускСервере() Экспорт

	// Дано
	АдресТеста = "checkup";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьОбработкуГетПараметров() Экспорт

	// Дано
	АдресТеста = "getparams?animal1=Кошка&animal2=Собака";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("Кошка И Собака");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьОбработкуУпорядоченныхГетПараметров() Экспорт

	// Дано
	АдресТеста = "getorderedparams/Кошка/Собака";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("Кошка И Собака");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьОбработкуПостЗапроса() Экспорт

	// Дано
	АдресТеста = "postparams";
	ТелоЗапроса = "animal1=Кошка&animal2=Собака";

	// Когда
	Ответ = ПостЗапросТелоИзСтроки(АдресТеста, ТелоЗапроса);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("Кошка И Собака");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьРаботуКук() Экспорт

	// Дано
	ЗначениеКуки = Строка(Новый УникальныйИдентификатор());
	АдресТеста = СтрШаблон("setcookie?pechenka=%1", ЗначениеКуки);

	// Когда
	Ответ = ГетЗапрос(АдресТеста);
	ТекстКук = Ответ.Заголовки.Получить("Set-Cookie");


	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(СтрНайти(ТекстКук, ЗначениеКуки)).Больше(0);

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьРаботуСессий() Экспорт

	// Дано
	Значение = Строка(Новый УникальныйИдентификатор());
	АдресУстановки = СтрШаблон("setsessiondata?userdata=%1", Значение);
	АдресПолучения = "readsessiondata";

	// Когда
	ОтветУстановки = ГетЗапрос(АдресУстановки);
	ТекстКук = ОтветУстановки.Заголовки.Получить("Set-Cookie");
	МеткаСессии = "SessionID=";
	НачалоИдСессии = СтрНайти(ТекстКук,МеткаСессии);
	КонецИдСесии = СтрНайти(ТекстКук,";",,НачалоИдСессии);
	ИдСессии = СтрЗаменить(Сред(ТекстКук, НачалоИдСессии, КонецИдСесии - НачалоИдСессии), МеткаСессии, "");

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Cookie", "SessionID=" + ИдСессии);
	ОтветПолучения = ГетЗапрос(АдресПолучения, Заголовки);

	// Тогда
	Ожидаем.Что(ОтветУстановки.КодСостояния).Равно(200);
	Ожидаем.Что(ОтветПолучения.КодСостояния).Равно(200);
	Ожидаем.Что(ОтветПолучения.ПолучитьТелоКакСтроку()).Равно(Значение);

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьПолучениеФайлаССервера() Экспорт

	// Дано
	ЗначениеКуки = Строка(Новый УникальныйИдентификатор());
	АдресТеста = "textfile.txt";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);
	ДДТело = Ответ.ПолучитьТелоКакДвоичныеДанные();
	ТекстТело = ПолучитьСтрокуИзДвоичныхДанных(ДДТело);

	Чтение = Новый ЧтениеТекста();
	Чтение.Открыть("./tests/app/files/textfile.txt");
	ТекстИзФайла = Чтение.Прочитать();
	Чтение.Закрыть();


	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(ТекстТело).Равно(ТекстИзФайла);

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьОграничениеДоступа() Экспорт

	// Дано
	АдресТеста = "user";
	Логипас = "Пользователь:111";
	Заголовки = Новый Соответствие();
	ХешЛогипасов = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Логипас));
	Заголовки.Вставить("Authorization", "Basic " + ХешЛогипасов);

	ЗаголовкиНеКорректные = Новый Соответствие();
	ХешЛогипасовНеКорректные = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Логипас+"1"));
	ЗаголовкиНеКорректные.Вставить("Authorization", "Basic " + ХешЛогипасовНеКорректные);


	// Когда
	ОтветЗапросАвторизации = ГетЗапрос(АдресТеста);
	ОтветАвторизован = ГетЗапрос(АдресТеста, Заголовки);
	ОтветНеАвторизован = ГетЗапрос(АдресТеста, ЗаголовкиНеКорректные);

	// Тогда
	Ожидаем.Что(ОтветЗапросАвторизации.КодСостояния).Равно(401);
	Ожидаем.Что(ОтветАвторизован.КодСостояния).Равно(200);
	Ожидаем.Что(ОтветНеАвторизован.КодСостояния).Равно(401);

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьРаботуШаблонов() Экспорт

	// Дано
	АдресТеста = "view/1";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("Заголовок 1 Текст 2 Вложенный текст 3 4 конец");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьШаблонныеУРЛЫ() Экспорт

	// Дано
	АдресТеста = "templateuri/Малинка/Желудь/Картошка";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("Малинка Желудь Картошка");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьШаблонныеУРЛЫСложение() Экспорт

	// Дано
	АдресТеста = "calc/plus/1/2";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("3");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьШаблонныеУРЛЫВычитание() Экспорт

	// Дано
	АдресТеста = "calc/minus/3/2";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("1");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьШаблонныеУРЛУмножение() Экспорт

	// Дано
	АдресТеста = "calc/3/multiply/2";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("6");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьШаблонныеУРЛЫДеление() Экспорт

	// Дано
	АдресТеста = "calc/6/devide/2";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("3");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьОбработкуГетПараметровПоИмени() Экспорт

	// Дано
	АдресТеста = "getparamsbyname?ИмяКошки=Мурка&ИмяСобаки=Жучка";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("ИмяКошки=Мурка И ИмяСобаки=Жучка");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьОбработкуПостЗапросаКакОбъект() Экспорт

	// Дано
	АдресТеста = "postjsonbody";
	ТелоЗапроса = "{""Имя"": ""Иван"", ""Фамилия"": ""Пупкин""}";
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");

	// Когда
	Ответ = ПостЗапросТелоИзСтроки(АдресТеста, ТелоЗапроса, Заголовки);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("Иван Пупкин");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьОбработкуПостЗапросаКакФорма() Экспорт

	// Дано
	АдресТеста = "postformbody";
	ТелоЗапроса = "Имя=ivan&Фамилия=pupkin";
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");

	// Когда
	Ответ = ПостЗапросТелоИзСтроки(АдресТеста, ТелоЗапроса, Заголовки);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("ivan pupkin");

КонецПроцедуры