#Использовать autumn
#Использовать ".."
#Использовать asserts

Перем Сервер;

Процедура ПередЗапускомТеста() Экспорт	
	ВключитьСервер();
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура ВключитьСервер() 
	
	Если Сервер = Неопределено Тогда
		Сервер = Новый Поделка();
		ФоновыеЗадания.Выполнить(Сервер, "ЗапуститьПриложение");
	КонецЕсли;

КонецПроцедуры

Функция ГетЗапрос(АдресТеста, Заголовки = Неопределено)
	Соединение = Новый HTTPСоединение("http://localhost",3333,,,,5);
	Запрос = Новый HTTPЗапрос(СтрШаблон("/tests/%1", АдресТеста));
	Если Не Заголовки = Неопределено Тогда
		Запрос.Заголовки = Заголовки;
	КонецЕсли;
	Ответ = Соединение.Получить(Запрос);
	Возврат Ответ;
КонецФункции

Функция ПостЗапросТелоИзСтроки(АдресТеста, ТелоЗапроса)
	Соединение = Новый HTTPСоединение("http://localhost",3333,,,,5);
	Запрос = Новый HTTPЗапрос(СтрШаблон("/tests/%1", АдресТеста));
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Возврат Ответ;
КонецФункции

&Тест
Процедура Должен_ПроверитьЗапускСервере() Экспорт

	// Дано
	АдресТеста = "checkup";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьОбработкуГетПараметров() Экспорт

	// Дано
	АдресТеста = "getparams?animal1=Кошка&animal2=Собака";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("Кошка И Собака");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьОбработкуУпорядоченныхГетПараметров() Экспорт

	// Дано
	АдресТеста = "getorderedparams/Кошка/Собака";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("Кошка И Собака");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьОбработкуПостЗапроса() Экспорт

	// Дано
	АдресТеста = "postparams";
	ТелоЗапроса = "animal1=Кошка&animal2=Собака";

	// Когда
	Ответ = ПостЗапросТелоИзСтроки(АдресТеста, ТелоЗапроса);

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку()).Равно("Кошка И Собака");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьРаботуКук() Экспорт

	// Дано
	ЗначениеКуки = Строка(Новый УникальныйИдентификатор());
	АдресТеста = СтрШаблон("setcookie?pechenka=%1", ЗначениеКуки);

	// Когда
	Ответ = ГетЗапрос(АдресТеста);
	ТекстКук = Ответ.Заголовки.Получить("Set-Cookie");


	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(СтрНайти(ТекстКук, ЗначениеКуки)).Больше(0);

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьРаботуСессий() Экспорт

	// Дано
	Значение = Строка(Новый УникальныйИдентификатор());
	АдресУстановки = СтрШаблон("setsessiondata?userdata=%1", Значение);
	АдресПолучения = "readsessiondata";

	// Когда
	ОтветУстановки = ГетЗапрос(АдресУстановки);
	ТекстКук = ОтветУстановки.Заголовки.Получить("Set-Cookie");
	МеткаСессии = "SessionID=";
	НачалоИдСессии = СтрНайти(ТекстКук,МеткаСессии);
	КонецИдСесии = СтрНайти(ТекстКук,";",,НачалоИдСессии);
	ИдСессии = СтрЗаменить(Сред(ТекстКук, НачалоИдСессии, КонецИдСесии - НачалоИдСессии), МеткаСессии, "");

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Cookie", "SessionID=" + ИдСессии);
	ОтветПолучения = ГетЗапрос(АдресПолучения, Заголовки);

	// Тогда
	Ожидаем.Что(ОтветУстановки.КодСостояния).Равно(200);
	Ожидаем.Что(ОтветПолучения.КодСостояния).Равно(200);
	Ожидаем.Что(ОтветПолучения.ПолучитьТелоКакСтроку()).Равно(Значение);

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьПолучениеФайлаССервера() Экспорт

	// Дано
	ЗначениеКуки = Строка(Новый УникальныйИдентификатор());
	АдресТеста = "textfile.txt";

	// Когда
	Ответ = ГетЗапрос(АдресТеста);
	ДДТело = Ответ.ПолучитьТелоКакДвоичныеДанные();
	ТекстТело = ПолучитьСтрокуИзДвоичныхДанных(ДДТело);

	Чтение = Новый ЧтениеТекста();
	Чтение.Открыть("./tests/app/files/textfile.txt");
	ТекстИзФайла = Чтение.Прочитать();
	Чтение.Закрыть();


	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(ТекстТело).Равно(ТекстИзФайла);

КонецПроцедуры
