#Использовать autumn
#Использовать ".."
#Использовать asserts
#Использовать 1connector

Перем Поделка;
Перем КаталогСФайлами;

Процедура ПередЗапускомТеста() Экспорт	
	ВключитьСервер();
	КаталогСФайлами = ОбъединитьПути("tests", "tmp");
	// ФС.ОбеспечитьПустойКаталог(КаталогСФайлами);
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура ВключитьСервер() 
	
	Если Поделка = Неопределено Тогда
		Поделка = Новый Поделка();
		Поделка.ЗапуститьПриложение();
		ВебСервер = Поделка.НайтиЖелудь("ВебСервер");
		ФоновыеЗадания.Выполнить(ВебСервер, "Старт");
		// Подождем что бы сервер успел запустится и проинициализироваться.
		Приостановить(1000);
		Настройки = Поделка.НайтиЖелудь("Настройки");
		Настройки.ЗадержкаПередЗакрытиемСокета = 300;
		Настройки.ИнтервалПроверкиСоединенийСерверныхСобытий = 100;
	КонецЕсли;

КонецПроцедуры

Функция СгенерироватьФайл(ИмяФайла, КоличествоСтрок)
	Текст = "1234567890qwertyuiopasdfghjklzxcvbnm-" + ВРег("1234567890qwertyuiopasdfghjklzxcvbnm");
	ПутьКФайлу = ОбъединитьПути(КаталогСФайлами, ИмяФайла);
	ЗаписьТекста = Новый ЗаписьТекста(ПутьКФайлу, , "");
	Для Сч = 1 по КоличествоСтрок Цикл
		ЗаписьТекста.ЗаписатьСтроку(Текст);
	КонецЦикла;
	ЗаписьТекста.Закрыть();

	Возврат ПутьКФайлу;
КонецФункции

Функция ХешФайла(ПутьКФайлу)
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.ДобавитьФайл(ПутьКФайлу);
	Хеш = ХешированиеДанных.ХешСуммаСтрокой;

	Возврат Хеш;
КонецФункции

&Тест
Процедура ОтправкаМаленькогоФайла() Экспорт
	
	// Дано
	ФайлИмя = СгенерироватьФайл("input.txt", 10);

	Хеш1 = ХешФайла(ФайлИмя);

	Файлы = Новый Структура;
	Файлы.Вставить("Имя", "f1");
	Файлы.Вставить("ИмяФайла", "file1.txt");
	Файлы.Вставить("Данные", Новый ДвоичныеДанные(ФайлИмя));
	Файлы.Вставить("Тип", "text/plain");

	// Когда
	Ответ = КоннекторHTTP.Post("http://localhost:3333/multipart/upload", Неопределено, Неопределено, Новый Структура("Файлы,Таймаут", Файлы, 500));
	Хеш2 = ХешФайла(ОбъединитьПути(КаталогСФайлами, "output.txt"));

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Хеш1).Равно(Хеш2);

КонецПроцедуры

&Тест
Процедура ОтправкаБольшогоФайла()

	// Дано
	ФайлИмя = СгенерироватьФайл("input.txt", 30000);

	Хеш1 = ХешФайла(ФайлИмя);

	Файлы = Новый Структура;
	Файлы.Вставить("Имя", "f1");
	Файлы.Вставить("ИмяФайла", "file1.txt");
	Файлы.Вставить("Данные", Новый ДвоичныеДанные(ФайлИмя));
	Файлы.Вставить("Тип", "text/plain");

	// Когда
	Ответ = КоннекторHTTP.Post("http://localhost:3333/multipart/upload", Неопределено, Неопределено, Новый Структура("Файлы,Таймаут", Файлы, 500));
	Хеш2 = ХешФайла(ОбъединитьПути(КаталогСФайлами, "output.txt"));

	// Тогда
	Ожидаем.Что(Ответ.КодСостояния).Равно(200);
	Ожидаем.Что(Хеш1).Равно(Хеш2);

КонецПроцедуры
