
ТСПСервер = Новый TCPСервер(3333);
ПортЦели = 3331;
		
ТСПСервер.Запустить();

Счетчик = 0;
ВсегоЗапросов = 5;

Пока Счетчик <= ВсегоЗапросов Цикл

	СоединениеВХ = ТСПСервер.ОжидатьСоединения();

	Сообщить(Счетчик);

	Сообщить(ТекущаяДата());

	ТекстЗапроса = СоединениеВХ.ПрочитатьДвоичныеДанные();

	Сообщить("--zapros");

	Сообщить(ПолучитьСтрокуИзДвоичныхДанных(ТекстЗапроса));

	СоединениеИСХ = Новый TCPСоединение("localhost", ПортЦели);

	СоединениеИСХ.ОтправитьДвоичныеДанные(ТекстЗапроса);

	Сообщить("--otvet");

	Ответ = СоединениеИСХ.ПрочитатьДвоичныеДанные();

	Сообщить(ПолучитьСтрокуИзДвоичныхДанных(Ответ));

	СоединениеИСХ.Закрыть();

	СоединениеВХ.ОтправитьДвоичныеДанные(Ответ);

	СоединениеВХ.Закрыть();

	Счетчик = Счетчик + 1;

КонецЦикла;

ТСПСервер.Остановить();
