Функция РазделитьДвоичныеДанныеРазделителемВМассив(Знач ДвоичныеДанные, Разделитель) Экспорт

	БуферДвоичныхДанных = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные);

	Массив = БуферДвоичныхДанных.Разделить(ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(Разделитель));
	
	Результат = Новый Массив();

	Для Каждого Элемент Из Массив Цикл
		Результат.Добавить(ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(Элемент));
	КонецЦикла;

	Возврат Результат;

КонецФункции

дд = Новый ДвоичныеДанные("tests/tmp/q_a1de7601-ed88-47b2-8431-d52de4f42387.txt");

ндд = РазделитьДвоичныеДанныеРазделителемВМассив(дд, ПолучитьДвоичныеДанныеИзBase64Строки("77u/"));

Сообщить("-------");
Для Каждого э из ндд Цикл
	Сообщить(э);
	Сообщить(ПолучитьСтрокуИзДвоичныхДанных(э));
КонецЦикла;


