#Использовать asserts
#Использовать ".."

Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура ЗапуститьПроверкуВсего()
	Сервер = ФабрикаСерверов.СоздатьСервер();	
	
	Контекст1 = Сервер.МенеджерПриложений.ДобавитьПриложениеИзКаталога("Тест1", "./tests/testapp");
	Сервер.МенеджерПриложений.ДобавитьКаталогСтатичныхФайлов("./tests/files", "/f");

	Сервер.Старт();

	
	//-
	// Строка = "самая простая рзд строка !4; ";
	// Разделитель = "рзд";
	// дд = ПолучитьДвоичныеДанныеИзСтроки(Разделитель);
	// ддс = ПолучитьДвоичныеДанныеИзСтроки(Строка);
	// Части = РазделитьДвоичныеДанныеРазделителем(ддс, дд);
	// с1 = ПолучитьСтрокуИзДвоичныхДанных(Части.Лево);
	// с2 = ПолучитьСтрокуИзДвоичныхДанных(Части.Право);
КонецПроцедуры

ЗапуститьПроверкуВсего();