#Использовать asserts
#Использовать ".."

Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура ЗапуститьПроверкуВсего()
	Сервер = ФабрикаСерверов.СоздатьСервер();	
	Сервер.Настройки.Порт = 3331;
	Сервер.Настройки.ЗапросВФоновыхЗаданиях = Ложь;
	
	Контекст1 = Сервер.МенеджерПриложений.ДобавитьПриложениеИзКаталога("Тест1", "./tests/testapp");
	Сервер.МенеджерПриложений.ДобавитьКаталогСтатичныхФайлов("./tests/files", "/f");

	Сервер.Старт();

КонецПроцедуры

ЗапуститьПроверкуВсего();