&Пластилин
Перем Парсеры Экспорт;

&Лог
Перем Лог;

Перем ГСЧ;

&Контроллер("/greeter")
Процедура ПриСозданииОбъекта()
	ГСЧ = Новый ГенераторСлучайныхЧисел();
КонецПроцедуры

&Сводка("Тело запроса как нетипизированный объект")
&ТочкаМаршрута("postjsonbody")
Процедура ПроверкаПостЗапросаКакОбъект(Ответ, ТелоЗапросаОбъект, ЗаголовкиЗапроса) Экспорт
	Ответ.УстановитьТипКонтента("txt");
	Ответ.ТелоТекст = ЗаголовкиЗапроса["Content-Type"][0] + ТипЗнч(ТелоЗапросаОбъект)// СтрШаблон("%1 %2", ТелоЗапросаОбъект["Имя"], ТелоЗапросаОбъект["Фамилия"]);
КонецПроцедуры

&Сводка("Тело запроса как типизированный объект")
&ТочкаМаршрута("postjsontypedbody")
Процедура ПроверкаПостЗапросаКакТипизированныйОбъект(Ответ, &Тип("ТестовыйОбъект") ТелоЗапросаОбъект) Экспорт
	Ответ.УстановитьТипКонтента("txt");
	Ответ.ТелоТекст = СтрШаблон("%1 %2", ТелоЗапросаОбъект.Имя, ТелоЗапросаОбъект.Фамилия);
КонецПроцедуры

&Сводка("Параметры строки запроса по именам")
&ТочкаМаршрута("getparamsbyname")
Процедура ПроверкаГетПараметровПоИмени(Ответ, ИмяКошки, ИмяСобаки) Экспорт
	Ответ.УстановитьТипКонтента("txt");
	Ответ.ТелоТекст = СтрШаблон("%1 И %2", "Кошка=" + ИмяКошки, "Собака=" + ИмяСобаки);
КонецПроцедуры

&Сводка("Умножение через шаблон пути")
&ТочкаМаршрута("calc/{Число1}/multiply/{Число2}")
Процедура ШаблонныеПараметрыУмножение(Ответ, &АтрибутСпана("Параметр1") Число1, &АтрибутСпана("Параметр2") Число2) Экспорт
	Лог.Информация("Получены числа " + Число1 + " и " + Число2);
	Ответ.УстановитьТипКонтента("txt");
	Ответ.ТелоТекст = Число(Число1) * Число(Число2);

	Приостановить(Гсч.СлучайноеЧисло(10, 2000));

	Лог.Информация("Результат умножения " + Ответ.ТелоТекст);
КонецПроцедуры

&Сводка("Несколько параметров пути подряд")
&ТочкаМаршрута("templateuri/{Ягода}/{Фрукт}/{Овощь}")
Процедура ШаблонныеПараметрыПути(Ответ, Фрукт, Овощь, Ягода) Экспорт
	Ответ.УстановитьТипКонтента("txt");
	Ответ.ТелоТекст = СтрШаблон("%1 %2 %3", Ягода, Фрукт, Овощь);
КонецПроцедуры

&Сводка("Произвольные параметры строки запроса")
&ТочкаМаршрута("getparams")
Процедура Приветствие(ПараметрыЗапросаИменные, Ответ) Экспорт

	Ответ.УстановитьТипКонтента("html");

	Имя = ПараметрыЗапросаИменные["name"];
	Фамилия = ПараметрыЗапросаИменные["familia"];

	Ответ.ТелоТекст = СтрШаблон("<!DOCTYPE html>
								|<div> Имя: %1 </div>
								|<div> Фамилия: %2 </div>",  Имя, Фамилия);

КонецПроцедуры

&Сводка("Калькулятор на позиционных сегментах пути")
&ТочкаМаршрута("calc")
Процедура Калькулятор(ПараметрыЗапросаПорядковые, Ответ) Экспорт

	Ответ.УстановитьТипКонтента("html");

	Если ПараметрыЗапросаПорядковые.Количество() <> 3 Тогда

		Решение = "Неверное число параметров";

	ИначеЕсли Не (ПараметрыЗапросаПорядковые[0] = "minus" 
				И НЕ ПараметрыЗапросаПорядковые[0] = "plus") Тогда
		Решение = "Операция не распознана";

	Иначе
		Попытка
			Число1 = Число(ПараметрыЗапросаПорядковые[1]);
			Число2 = Число(ПараметрыЗапросаПорядковые[2]);

			Если ПараметрыЗапросаПорядковые[0] = "minus" Тогда
				Решение = Число1 - Число2;
			Иначе
				Решение = Число1 + Число2;
			КонецЕсли

		Исключение
			Решение = "Ошибка конвертации в число"
		КонецПопытки;
	КонецЕсли;

	Ответ.ТелоТекст = СтрШаблон("<!DOCTYPE html>
								|<div> Ответ: %1 </div>",  Решение);

КонецПроцедуры

&Сводка("Форма возведения в степень")
&ТочкаМаршрута("inputstepen")
Процедура ВводСтепени(Ответ) Экспорт

	Ответ.УстановитьТипКонтента("html");

	Ответ.ТелоТекст = 
	"<form method=""post"" action=""/greeter/resultstepen"">
	|<label for=""chislo"">Введи число:</label><br>
	|<input type=""text"" id=""chislo"" name=""chislo""><br>
	|<label for=""stepen"">Введи степень:</label><br>
	|<input type=""text"" id=""stepen"" name=""stepen""><br><br>
	|<input type=""submit"" value=""Посчитать"">
	|</form> ";

КонецПроцедуры

&Сводка("Результат возведения в степень")
&ТочкаМаршрута("resultstepen")
Процедура ВозводительВСтепень(Ответ, ТелоЗапроса) Экспорт

	Ответ.УстановитьТипКонтента("html");

	ПостПараметры = Парсеры.ПараметрыИзТекста(ТелоЗапроса);

	Попытка
		Решение = Pow(ПостПараметры["chislo"], ПостПараметры["stepen"]);	
	Исключение
		Решение = "Ошибка при расчетах " + ОписаниеОшибки();
	КонецПопытки;

	Ответ.ТелоТекст = СтрШаблон("<!DOCTYPE html>
								|<div> Ответ: %1 </div>",  Решение);

КонецПроцедуры

&Сводка("Установить куку")
&ТочкаМаршрута("setcookie")
Процедура УстановитьКуку(Ответ) Экспорт

	Ответ.УстановитьТипКонтента("html");

	ИмяКуки = "LastEnterDate";
	ЗначениеКуки = ТекущаяДата();

	НоваяКука = Ответ.Куки.Добавить(ИмяКуки, ЗначениеКуки);

	Ответ.ТелоТекст = "<!DOCTYPE html>
						|<div> Кука установлена </div>";

КонецПроцедуры

&Сводка("Прочитать куку")
&ТочкаМаршрута("readcookie")
Процедура ПрочитатьКуку(КукиЗапроса, Ответ) Экспорт

	Ответ.УстановитьТипКонтента("html");

	ИмяКуки = "LastEnterDate";

	ЗначениеКуки = КукиЗапроса.ПолучитьЗначениеПоИмени(ИмяКуки);

	Ответ.ТелоТекст = СтрШаблон("<!DOCTYPE html>
								|<div> Кука: %1 </div>", ЗначениеКуки);

КонецПроцедуры

&Сводка("Записать данные в сессию")
&ТочкаМаршрута("setsessiondata")
Процедура УстановитьДанныеСессии(Ответ, ДанныеСессии) Экспорт

	Ответ.УстановитьТипКонтента("html");

	ИмяПараметраСессии = "ДатаПоследнегоВхода";
	ЗначениеПараметраСессии  = ТекущаяДата();

	
	ДанныеСессии[ИмяПараметраСессии] = ЗначениеПараметраСессии;

	Ответ.ТелоТекст = "<!DOCTYPE html>
						|<div> Данные сессии установлены </div>";

КонецПроцедуры

&Сводка("Прочитать данные сессии")
&ТочкаМаршрута("readsessiondata")
Процедура ПрочитатьДанныеСессии(Ответ, ДанныеСессии) Экспорт

	Ответ.УстановитьТипКонтента("html");

	ИмяПараметраСессии = "ДатаПоследнегоВхода";
	ЗначениеПараметраСессии  = ДанныеСессии[ИмяПараметраСессии];

	Ответ.ТелоТекст = СтрШаблон("<!DOCTYPE html>
								|<div> Значение параметра сессии: %1 </div>", ЗначениеПараметраСессии);

КонецПроцедуры