#Использовать 1commands

&Пластилин Перем БрокерСообщенийВебСокетов;

&Лог
Перем Лог;

&Контроллер("/console")
Процедура ПриСозданииОбъекта()

КонецПроцедуры

&ТочкаМаршрута("run")
Процедура ВходящееСообщение(Идентификатор, Топик, Сообщение) Экспорт

	ВывестиСтрокиВБраузере(">" + Сообщение, Топик, Идентификатор);

	ЗапуститьПоцесс(Сообщение, Идентификатор, Топик);

КонецПроцедуры

&Отображение("./hwapp/view/console.html")
&ТочкаМаршрута("")
Процедура Главная() Экспорт
	
КонецПроцедуры

Процедура ЗапуститьПоцесс(ТекстКоманды, Идентификатор, Топик)
	Лог.Информация("Получена команда " + ТекстКоманды);
	Команда = Новый Команда;
	Команда.УстановитьСтрокуЗапуска(ТекстКоманды);

	Команда.Исполнить();

	Вывод = Команда.ПолучитьВывод();
	ВывестиСтрокиВБраузере(Вывод, Топик, Идентификатор);

	Лог.Информация("Команда обработана " + ТекстКоманды);
КонецПроцедуры

Процедура ВывестиСтрокиВБраузере(Текст, Топик, Идентификатор)
	
	Для Каждого ТекСтрока из СтрРазделить(Текст, Символы.ПС) Цикл
		БрокерСообщенийВебСокетов.ОтправитьСообщение(Топик, ФорматированноеСообщение(ТекСтрока), Идентификатор);
	КонецЦикла;

КонецПроцедуры

Функция ФорматированноеСообщение(ВыводКоманды)

	ОбъектДляПарсинга = Новый Структура("output", ВыводКоманды);

	Запись = новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, ОбъектДляПарсинга);

	Возврат Запись.Закрыть();
КонецФункции