&Пластилин
Перем МенеджерОтображений Экспорт;

&Лог
Перем Лог;

&Контроллер("/")
Процедура ПриСозданииОбъекта()

КонецПроцедуры

&Сводка("Страница с отображением")
&ТочкаМаршрута("view")
&Отображение("./hwapp/view/simple.html")
Процедура Вьюха() Экспорт
	Лог.Информация("Вьюха отработала");
КонецПроцедуры

&Сводка("Корневая страница примера")
&ТочкаМаршрута("")
Процедура Приветствие(Ответ) Экспорт

	Ответ.ТелоТекст = СтрШаблон("<!DOCTYPE html>
								|<div> %1 </div>",  "Привет новый дивный мир !");

КонецПроцедуры

&Сводка("Демонстрация страницы ошибки")
&Возвращает(Код = 500, Описание = "Необработанная ошибка приложения")
&ТочкаМаршрута("err")
Процедура Ошибка() Экспорт

	ВызватьИсключение "У меня ошибка";

КонецПроцедуры

&Сводка("Перенаправление на другой адрес")
&Возвращает(Код = 302, Описание = "Перенаправление")
&ТочкаМаршрута("redir")
Процедура Перенаправление(Ответ) Экспорт

	Ответ.Перенаправить("/");

КонецПроцедуры

Функция КастомныйШаблон404()
	Возврат "<!DOCTYPE html>
			|<div><h1> {{ Модель.КодСостояния }} </h1></div>
			|<div> {{ Модель.ТекстСообщения }} </div>
			|<div> Искомый ресурс {{ Модель.Запрос.Путь }} не найден </div>";
КонецФункции

&ФинальныйШтрих
Процедура ПостИнициализация() Экспорт
	МенеджерОтображений.УстановитьШаблон404(КастомныйШаблон404());
КонецПроцедуры