
Перем Имя Экспорт;

&Контроллер("/super/api/v1/dummy")
&Желудь
Процедура ПриСозданииОбъекта()

	Имя = "noname";

КонецПроцедуры

&ТочкаМаршрута("getname")
Процедура ВернутьИмя(ВходящийЗапрос, Ответ) Экспорт

	Новая = Ответ.Куки.Добавить("somecc", "hello");

	Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";

	Ответ.ТелоТекст = СтрШаблон("<!DOCTYPE html>
								|<div> %1 </div>
								|<img src=""/super/api/v1/dummy/img"" alt=""my img""> ",Имя);

КонецПроцедуры

&ТочкаМаршрута("setname")
Процедура УстановитьИмя(ВходящийЗапрос, Ответ) Экспорт

	Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";

	Имя = ВходящийЗапрос.ПараметрыИменные["name"];

	Ответ.ТелоТекст = СтрШаблон("<!DOCTYPE html>
								|<div> %1 </div>", "Ок");

КонецПроцедуры

&ТочкаМаршрута("img")
Процедура СкачатьКартинку(ВходящийЗапрос, Ответ) Экспорт
	
	Ответ.Заголовки["Content-Type"] = "image/png";

	Ответ.ТелоДвоичныеДанные = Новый ДвоичныеДанные("./tests/testapp/img.png");

КонецПроцедуры

&ТочкаМаршрута("err")
Процедура ВызватьОшибку(ВходящийЗапрос, Ответ) Экспорт

	ВызватьИсключение "Вызываю ошибку";

КонецПроцедуры