
&Контроллер("/super/api/v1/dummy")
&Желудь
Процедура ПриСозданииОбъекта()

КонецПроцедуры

&Отображение("./tests/testapp/hello.html")
&ТочкаМаршрута("getname")
Процедура ВернутьИмя(ВходящийЗапрос, Ответ, Сессия) Экспорт

	Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";

	Имя = Сессия.Данные["Имя"];

	Ответ.Модель = Новый Структура("Имя", ?(Имя = Неопределено, "НоуНейм", Имя));

КонецПроцедуры

&ТочкаМаршрута("setname")
Процедура УстановитьИмя(ВходящийЗапрос, Ответ, Сессия) Экспорт

	Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";

	Имя = ВходящийЗапрос.ПараметрыИменные["name"];

	Сессия.Данные["Имя"] = Имя;

	Ответ.ТелоТекст = СтрШаблон("<!DOCTYPE html>
								|<div> %1 </div>
								|<img src=""/super/api/v1/dummy/img"" alt=""my img""> ", "Ок");

КонецПроцедуры

&ТочкаМаршрута("img")
Процедура СкачатьКартинку(ВходящийЗапрос, Ответ, Сессия) Экспорт
	
	Ответ.Заголовки["Content-Type"] = "image/png";

	Ответ.ТелоДвоичныеДанные = Новый ДвоичныеДанные("./tests/testapp/img.png");

КонецПроцедуры

&ТочкаМаршрута("err")
Процедура ВызватьОшибку(ВходящийЗапрос, Ответ, Сессия) Экспорт

	ВызватьИсключение "Вызываю ошибку";

КонецПроцедуры