Перем ТекстПриветствия;
Перем ОбщийКонтейнер;

&Контроллер("/")
&Желудь
Процедура ПриСозданииОбъекта(&Пластилин("ОбщийКонтейнер") _ОбщийКонтейнер)
	ОбщийКонтейнер = _ОбщийКонтейнер;
	ТекстПриветствия = "Привет мир!";
КонецПроцедуры

&ТочкаМаршрута("/")
Процедура ВернутьИмя(ВходящийЗапрос, Ответ, Сессия) Экспорт

	Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";

	Ответ.ТелоТекст = СтрШаблон("<!DOCTYPE html>
								|<div> %1 </div>", ТекстПриветствия + ОбщийКонтейнер.Перечисления.ОписанияТиповРасширенийФайлов["json"]);

КонецПроцедуры