&Пластилин
Перем МенеджерОтображений Экспорт;

&Желудь
&Прозвище("Контроллер")
&Маршрут("/tests/view")
&Отображение(Шаблон = "./tests/app/view/main.html", Метод = "ПолучитьМодельКонтрола")
Процедура ПриСозданииОбъекта()

КонецПроцедуры

Функция ПолучитьМодельКонтрола() Экспорт
	Модель = Новый Структура("ТекстЗаголовка", "1");

	Возврат Модель;
КонецФункции

&Отображение("./tests/app/view/1.html")
&ТочкаМаршрута("1")
Процедура ДемонстрацияОтображения(Ответ) Экспорт
	Ответ.Модель = Новый Структура("Текст", "2");
	Ответ.Модель.Вставить("Вложенный", Новый Структура("Текст", "3"));
КонецПроцедуры
