
&Пластилин Перем БрокерСообщенийСобытийСервера;
&пластилин Перем ФабрикаОтветов;

Перем ИмяТопика;

Перем ИдПодключений Экспорт;
Перем КоличествоЗакрытыхСоединений Экспорт;

&Контроллер("/sse")
Процедура ПриСозданииОбъекта(&Пластилин ТопикиСерверныхСобытий)

	ИмяТопика = "/sse/test1";

	ТопикиСерверныхСобытий.Добавить(ИмяТопика,
									Новый Действие(ЭтотОбъект, "НовоеПодключениеССЕ"),
									Новый Действие(ЭтотОбъект, "ОтключениеССЕ"));

	ИнициализироватьСостояния();
КонецПроцедуры

Процедура ИнициализироватьСостояния() Экспорт
	ИдПодключений = Новый Массив;
	КоличествоЗакрытыхСоединений = 0;
КонецПроцедуры

Процедура НовоеПодключениеССЕ(Сессия, ИД) Экспорт

	ИдПодключений.Добавить(ИД);

КонецПроцедуры

Процедура ОтключениеССЕ(Сессия, ИД) Экспорт

	Сообщить("Отключился " + Ид);
	КоличествоЗакрытыхСоединений = КоличествоЗакрытыхСоединений + 1;
КонецПроцедуры

&ТочкаМаршрута("")
Процедура Главная() Экспорт
	
КонецПроцедуры

&ТочкаМаршрута("sendall/{Текст}")
Процедура ОтправитьВсем(Текст) Экспорт
	Событие = ФабрикаОтветов.СерверноеСобытие();
	Событие.ДобавитьСтроку(Текст);
	БрокерСообщенийСобытийСервера.ОтправитьСообщениеВсем(ИмяТопика, Событие);
КонецПроцедуры

&ТочкаМаршрута("sendalltype/{Текст}")
Процедура ОтправитьВсемКастомныйТип(Текст) Экспорт
	Событие = ФабрикаОтветов.СерверноеСобытие();
	Событие.ТипСобытия("evnt").ДобавитьСтроку(Текст);
	БрокерСообщенийСобытийСервера.ОтправитьСообщениеВсем(ИмяТопика, Событие);
КонецПроцедуры

&ТочкаМаршрута("sendbyid/{ид}")
Процедура ОтправитьПоИд(ид) Экспорт
	Событие = ФабрикаОтветов.СерверноеСобытие();
	Событие.ДобавитьСтроку("привет");
	БрокерСообщенийСобытийСервера.ОтправитьСообщениеПоИдСоединения(ид, Событие);
КонецПроцедуры

&ТочкаМаршрута("sendbut/{ид}")
Процедура ОтправитьКроме(ид) Экспорт
	Событие = ФабрикаОтветов.СерверноеСобытие();
	Событие.ДобавитьСтроку("привет");

	Массив = Новый Массив;
	Массив.Добавить(ид);

	БрокерСообщенийСобытийСервера.ОтправитьСообщениеВсемКроме(ИмяТопика, Событие, Массив);
КонецПроцедуры