&Пластилин Перем БрокерСообщенийВебСокетов;

Перем _Подключившиеся; // Массив Из Строка - идентификаторы из подписки на подключение
Перем _Отключившиеся; // Массив Из Строка - идентификаторы из подписки на отключение
Перем _ПадатьПриПодключении; // Булево - падать ли в подписке на подключение

&Контроллер("/socket")
Процедура ПриСозданииОбъекта()
	ИнициализироватьСостояния();
КонецПроцедуры

Процедура ИнициализироватьСостояния() Экспорт
	_Подключившиеся = Новый Массив;
	_Отключившиеся = Новый Массив;
	_ПадатьПриПодключении = Ложь;
КонецПроцедуры

Функция Подключившиеся() Экспорт
	Возврат _Подключившиеся;
КонецФункции

Функция Отключившиеся() Экспорт
	Возврат _Отключившиеся;
КонецФункции

Процедура ПадатьПриПодключении() Экспорт
	_ПадатьПриПодключении = Истина;
КонецПроцедуры

&ТочкаМаршрута("ws")
Процедура ДемонстрацияОтображения(Идентификатор, Топик, Сообщение) Экспорт

	БрокерСообщенийВебСокетов.ОтправитьСообщениеВсем(Топик, Сообщение + " 1");

КонецПроцедуры

&ПриПодключенииВебСокета("/socket/ws")
Процедура ПриПодключении(Идентификатор) Экспорт
	_Подключившиеся.Добавить(Идентификатор);
	Если _ПадатьПриПодключении Тогда
		ВызватьИсключение "Ошибка обработчика подключения";
	КонецЕсли;
КонецПроцедуры

&ПриОтключенииВебСокета("/socket/ws")
Процедура ПриОтключении(Идентификатор) Экспорт
	_Отключившиеся.Добавить(Идентификатор);
КонецПроцедуры
