&Пластилин Перем БрокерСообщенийВебСокетов;

Перем Подключившиеся Экспорт;
Перем Отключившиеся Экспорт;

&Контроллер("/socket")
Процедура ПриСозданииОбъекта()
	ИнициализироватьСостояния();
КонецПроцедуры

Процедура ИнициализироватьСостояния() Экспорт
	Подключившиеся = Новый Массив;
	Отключившиеся = Новый Массив;
КонецПроцедуры

&ТочкаМаршрута("ws")
Процедура ДемонстрацияОтображения(Идентификатор, Топик, Сообщение) Экспорт

	БрокерСообщенийВебСокетов.ОтправитьСообщениеВсем(Топик, Сообщение + " 1");

КонецПроцедуры

&ПриПодключенииВебСокета("/socket/ws")
Процедура ПриПодключении(Идентификатор) Экспорт
	Подключившиеся.Добавить(Идентификатор);
КонецПроцедуры

&ПриОтключенииВебСокета("/socket/ws")
Процедура ПриОтключении(Идентификатор) Экспорт
	Отключившиеся.Добавить(Идентификатор);
КонецПроцедуры
