// Помечает класс как контроллер веб-приложения.
//
// Контроллер является желудем и имеет `&Прозвище("Контроллер")`, поэтому может
// запрашивать прилепление частиц, обрабатываться `&Напильник`ом и внедряться
// коллекцией по прозвищу.
//
// Методы контроллера, помеченные `&ТочкаМаршрута`, становятся обработчиками
// запросов по адресу, склеенному из адреса контроллера и адреса точки маршрута.
//
// Размещается над конструктором класса.
//
// Параметры:
//   Значение - Строка - Базовый адрес контроллера. Значение по умолчанию: `"/"`
//
// Пример:
// &Контроллер("/greeter")
// Процедура ПриСозданииОбъекта()
// КонецПроцедуры
// .
// // Обработает GET /greeter/hello
// &ТочкаМаршрута("hello")
// Процедура Привет(Ответ) Экспорт
// .   Ответ.ТелоТекст = "Привет!";
// КонецПроцедуры
//
&Аннотация(Значение = "Контроллер")
&Желудь
&Наблюдаемый
&Прозвище("Контроллер")
Процедура ПриСозданииОбъекта(Значение = "/")

КонецПроцедуры
