#Использовать autumn-logos

&Лог("winow.settingsInit")
Перем Лог;

// Контроллы приложения: таблица со строками (Имя, Желудь, ОпределениеЖелудя).
&Пластилин(Значение = "Контроллер", Тип = "ТаблицаЗначений")
Перем Контроллы;

&Пластилин Перем РегистраторКаталогаФайлов;
&Пластилин Перем СборщикМаршрутов;
&Пластилин Перем ВебСервер;

&Деталька("winow.КаталогиСФайлами")
Перем КаталогиСФайлами;

&Деталька(Значение = "winow.АвтоСтарт", ЗначениеПоУмолчанию = Ложь)
Перем АвтоСтарт;

&Рогатка
Процедура ПриСозданииОбъекта() 
	
КонецПроцедуры

Процедура ПриЗапускеПриложения() Экспорт

	ИнициализацияКонтролов();

	Старт();

КонецПроцедуры

Процедура ИнициализацияКонтролов() Экспорт

	Лог.Отладка(СтрШаблон("Регистрация контролов %1", Контроллы.Количество()));

	Для Каждого Контролл из Контроллы Цикл
		СборщикМаршрутов.НайтиИЗарегистрироватьМаршруты(Контролл.Желудь, Контролл.ОпределениеЖелудя);
	КонецЦикла;

	РегистраторКаталогаФайлов.ОбновитьСтатичныеФайлы();

КонецПроцедуры

Процедура Старт()

	Если АвтоСтарт = Истина Тогда
		ВебСервер.Старт();
	КонецЕсли;
	
КонецПроцедуры