#Использовать autumn

&Пластилин Перем ГенераторOpenApi;

&Желудь
Процедура ПриСозданииОбъекта()

КонецПроцедуры

// Отдает JSON со спецификацией OpenAPI.
//
// Параметры:
//   Ответ - Ответ - формируемый ответ сервера.
Процедура ОтдатьСпецификацию(Ответ) Экспорт

	Ответ.УстановитьТипКонтента("json");
	Ответ.ТелоТекст = ГенераторOpenApi.СпецификацияТекстом();

КонецПроцедуры

// Отдает HTML-страницу Swagger UI.
//
// Параметры:
//   Ответ - Ответ - формируемый ответ сервера.
Процедура ОтдатьSwaggerUI(Ответ) Экспорт

	Ответ.УстановитьТипКонтента("html");
	Ответ.ТелоТекст = ГенераторOpenApi.СтраницаSwaggerUI();

КонецПроцедуры
