
Перем ПодписчикиОткрытия;
Перем ПодписчикиЗакрытия;
Перем ОбработчикСобытий; // ОбработчикСерверныхСобытий - шов трассировки, через который вызываются обработчики

&Желудь
Процедура ПриСозданииОбъекта(&Пластилин ОбработчикСерверныхСобытий)
	ОбработчикСобытий = ОбработчикСерверныхСобытий;
	Инициализация();
КонецПроцедуры

// Параметры:
//  Подключение - Структура - Открытое соединение, см. ОбработчикСерверныхСобытий.
//
Процедура СобытиеОткрытия(Подключение) Экспорт
	Для Каждого Подписчики Из ПодписчикиОткрытия.НайтиСтроки(Новый Структура("Топик", Подключение.Топик)) Цикл
		ВыполнитьОбработчикФоном(Истина, Подписчики.Обработчик, Подключение);
	КонецЦикла;
КонецПроцедуры

// Параметры:
//  Подключение - Структура - Закрытое соединение, см. ОбработчикСерверныхСобытий.
//
Процедура СобытиеЗакрытия(Подключение) Экспорт
	Для Каждого Подписчики Из ПодписчикиЗакрытия.НайтиСтроки(Новый Структура("Топик", Подключение.Топик)) Цикл
		ВыполнитьОбработчикФоном(Ложь, Подписчики.Обработчик, Подключение);
	КонецЦикла;
КонецПроцедуры

Процедура ВыполнитьОбработчикФоном(ЭтоПодключение, Обработчик, Подключение)
	Параметры = Новый Массив();
	Параметры.Добавить(ЭтоПодключение);
	Параметры.Добавить(Обработчик);
	Параметры.Добавить(Подключение);
	ФоновыеЗадания.Выполнить(ЭтотОбъект, "ЗапуститьФоновоеЗаданиеОбработчика", Параметры);
КонецПроцедуры

// Экспортная, потому что служит точкой входа для ФоновыеЗадания.Выполнить.
//
// Параметры:
//  ЭтоПодключение - Булево - Истина - обработчик подключения, Ложь - отключения.
//  Обработчик     - Действие - Обработчик подписки.
//  Подключение    - Структура - Соединение, см. ОбработчикСерверныхСобытий.
//
Процедура ЗапуститьФоновоеЗаданиеОбработчика(ЭтоПодключение, Обработчик, Подключение) Экспорт

	Приостановить(50);

	Если ЭтоПодключение Тогда
		ОбработчикСобытий.ОбработатьПодключение(Подключение, Обработчик);
	Иначе
		ОбработчикСобытий.ОбработатьОтключение(Подключение, Обработчик);
	КонецЕсли;

КонецПроцедуры

Процедура ПодпискаНаОткрытие(Топик, Обработчик) Экспорт
	НоваяПодписка = ПодписчикиОткрытия.Добавить();
	НоваяПодписка.Топик = Топик;
	НоваяПодписка.Обработчик = Обработчик;	
КонецПроцедуры

Процедура ПодпискаНаЗакрытие(Топик, Обработчик) Экспорт
	НоваяПодписка = ПодписчикиЗакрытия.Добавить();
	НоваяПодписка.Топик = Топик;
	НоваяПодписка.Обработчик = Обработчик;	
КонецПроцедуры

Процедура Инициализация()
	ПодписчикиОткрытия = Новый ТаблицаЗначений();
	ПодписчикиОткрытия.Колонки.Добавить("Топик");
	ПодписчикиОткрытия.Колонки.Добавить("Обработчик");

	ПодписчикиЗакрытия = Новый ТаблицаЗначений();
	ПодписчикиЗакрытия.Колонки.Добавить("Топик");
	ПодписчикиЗакрытия.Колонки.Добавить("Обработчик");
КонецПроцедуры

