
&Пластилин Перем ОбработчикСоединений;
&Пластилин Перем СлушательПорта;
&Пластилин Перем КонтрольСоединенийСерверныхСобытий;
&Пластилин Перем СоединенияВебСокетов; // закрываются при остановке сервера
&Пластилин Перем СоединенияСерверныхСобытий; // закрываются при остановке сервера

&Желудь
Процедура ПриСозданииОбъекта()
	
КонецПроцедуры 

Процедура Старт() Экспорт

	КонтрольСоединенийСерверныхСобытий.Старт();

	СлушательПорта.Запустить();

	Пока СлушательПорта.Активен() Цикл

		Соединение = СлушательПорта.ОжидатьСоединения();

		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить(Соединение);

		ФоновыеЗадания.Выполнить(ОбработчикСоединений, "Обработать", МассивПараметров);

	КонецЦикла;

	КонтрольСоединенийСерверныхСобытий.Стоп();
	
КонецПроцедуры

Процедура Стоп() Экспорт
	СлушательПорта.Остановить();
	СоединенияВебСокетов.ПрерватьВсеСоединения();
	СоединенияСерверныхСобытий.ЗакрытьВсеСоединения();
КонецПроцедуры